espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/emlib/inc/em_cmu.h
/** Default HFXO initialization values for external sine mode. */
#define CMU_HFXOINIT_EXTERNAL_SINE                                               \
  {                                                                              \
    (CMU_HfxoCbLsbTimeout_TypeDef)0,       /* timeoutCbLsb                    */ \
    (CMU_HfxoSteadyStateTimeout_TypeDef)0, /* timeoutSteady, first lock       */ \
    (CMU_HfxoSteadyStateTimeout_TypeDef)0, /* timeoutSteady, subseq. locks    */ \
    0U,                         /* ctuneXoStartup                             */ \
    0U,                         /* ctuneXiStartup                             */ \
    0U,                         /* coreBiasStartup                            */ \
    0U,                         /* imCoreBiasStartup                          */ \
    cmuHfxoCoreDegen_None,                                                       \
    cmuHfxoCtuneFixCap_None,                                                     \
    0U,                         /* ctuneXoAna                                 */ \
    0U,                         /* ctuneXiAna                                 */ \
    0U,                         /* coreBiasAna                                */ \
    false, /* enXiDcBiasAna, false=DC true=AC coupling of signal              */ \
    cmuHfxoOscMode_ExternalSine,                                                 \
    false,                      /* forceXo2GndAna                             */ \
    false,                      /* forceXi2GndAna (Never enable in sine mode) */ \
    false,                      /* DisOndemand                                */ \
    false,                      /* ForceEn                                    */ \
    false                       /* Lock registers                             */ \
  }

/** Default HFXO initialization values for external sine mode with peak detector. */
#define CMU_HFXOINIT_EXTERNAL_SINEPKDET                                          \
  {                                                                              \
    (CMU_HfxoCbLsbTimeout_TypeDef)0,       /* timeoutCbLsb                    */ \
    (CMU_HfxoSteadyStateTimeout_TypeDef)0, /* timeoutSteady, first lock       */ \
    (CMU_HfxoSteadyStateTimeout_TypeDef)0, /* timeoutSteady, subseq. locks    */ \
    0U,                         /* ctuneXoStartup                             */ \
    0U,                         /* ctuneXiStartup                             */ \
    0U,                         /* coreBiasStartup                            */ \
    0U,                         /* imCoreBiasStartup                          */ \
    cmuHfxoCoreDegen_None,                                                       \
    cmuHfxoCtuneFixCap_None,                                                     \
    0U,                         /* ctuneXoAna                                 */ \
    0U,                         /* ctuneXiAna                                 */ \
    0U,                         /* coreBiasAna                                */ \
    false, /* enXiDcBiasAna, false=DC true=AC coupling of signal              */ \
    cmuHfxoOscMode_ExternalSinePkDet,                                            \
    false,                      /* forceXo2GndAna                             */ \
    false,                      /* forceXi2GndAna (Never enable in sine mode) */ \
    false,                      /* DisOndemand                                */ \
    false,                      /* ForceEn                                    */ \
    false                       /* Lock registers                             */ \
  }
#endif

#if defined(_HFXO_BUFOUTCTRL_MASK)

/** Crystal sharing timeout start up timeout. */
SL_ENUM_GENERIC(CMU_BufoutTimeoutStartup_TypeDef, uint32_t) {
  startupTimeout42Us  = _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T42US,  /**< Timeout set to 42 us. */
  startupTimeout83Us  = _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T83US,  /**< Timeout set to 83 us. */
  startupTimeout108Us = _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T108US, /**< Timeout set to 108 us. */
  startupTimeout133Us = _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T133US, /**< Timeout set to 133 us. */
  startupTimeout158Us = _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T158US, /**< Timeout set to 158 us. */
  startupTimeout183Us = _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T183US, /**< Timeout set to 183 us. */
  startupTimeout208Us = _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T208US, /**< Timeout set to 208 us. */
  startupTimeout233Us = _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T233US, /**< Timeout set to 233 us. */
  startupTimeout258Us = _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T258US, /**< Timeout set to 258 us. */
  startupTimeout283Us = _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T283US, /**< Timeout set to 283 us. */
  startupTimeout333Us = _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T333US, /**< Timeout set to 333 us. */
  startupTimeout375Us = _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T375US, /**< Timeout set to 375 us. */
  startupTimeout417Us = _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T417US, /**< Timeout set to 417 us. */
  startupTimeout458Us = _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T458US, /**< Timeout set to 458 us. */
  startupTimeout500Us = _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T500US, /**< Timeout set to 500 us. */
  startupTimeout667Us = _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T667US, /**< Timeout set to 667 us. */
};

/** Crystal sharing leader initialization structure. */
typedef struct {
  bool                                minimalStartupDelay;  /**< If enabled, bufout won't start until timeout expires. */
  CMU_BufoutTimeoutStartup_TypeDef    timeoutStartup;       /**< Wait duration of the oscillator startup sequence to prevent bufout starting too early. */
} CMU_BUFOUTLeaderInit_TypeDef;

/** Default crystal sharing master initialization values. */
#define CMU_HFXO_CRYSTAL_INIT_LEADER_DEFAULT        \
  {                                                 \
    true,                 /* minimalStartupDelay */ \
    startupTimeout208Us,  /* timeoutStartup      */ \
  }
#endif

#if defined(_HFXO_CTRL_PRSSTATUSSEL0_MASK)
/** PRS status select output signal. */
SL_ENUM(CMU_PRS_Status_Output_Select_TypeDef) {
  PRS_Status_select_0,  /**< PRS status 0 output signal. */
  PRS_Status_select_1   /**< PRS status 1 output signal. */
};

