espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/emlib/inc/em_cmu.h
/** Crystal sharing follower initialization structure. */
typedef struct {
  CMU_PRS_Status_Output_Select_TypeDef prsStatusSelectOutput; /**< PRS status output select.  */
  bool                                 em23OnDemand;          /**< Enable em23 on demand.     */
  bool                                 regLock;               /**< Lock registers.            */
} CMU_CrystalSharingFollowerInit_TypeDef;

/** Default crystal sharing follower initialization values. */
#define CMU_HFXO_CRYSTAL_INIT_Follower_DEFAULT                                \
  {                                                                           \
    PRS_Status_select_0,                          /* prsStatusSelectOutput */ \
    true,                                         /* em23OnDemand          */ \
    false                                         /* regLock               */ \
  }
#endif

/** DPLL initialization structure. Frequency will be Fref*(N+1)/(M+1). */
typedef struct {
  uint32_t  frequency;                  /**< PLL frequency value, max 80 MHz. */
  uint16_t  n;                          /**< Factor N. 300 <= N <= 4095       */
  uint16_t  m;                          /**< Factor M. M <= 4095              */
  CMU_Select_TypeDef        refClk;     /**< Reference clock selector.        */
  CMU_DPLLEdgeSel_TypeDef   edgeSel;    /**< Reference clock edge detect selector. */
  CMU_DPLLLockMode_TypeDef  lockMode;   /**< DPLL lock mode selector.         */
  bool      autoRecover;                /**< Enable automatic lock recovery.  */
  bool      ditherEn;                   /**< Enable dither functionality.  */
} CMU_DPLLInit_TypeDef;

/**
 * DPLL initialization values for 39,998,805 Hz using LFXO as reference
 * clock, M=2 and N=3661.
 */
#define CMU_DPLL_LFXO_TO_40MHZ                                             \
  {                                                                        \
    39998805,                     /* Target frequency.                  */ \
    3661,                         /* Factor N.                          */ \
    2,                            /* Factor M.                          */ \
    cmuSelect_LFXO,               /* Select LFXO as reference clock.    */ \
    cmuDPLLEdgeSel_Fall,          /* Select falling edge of ref clock.  */ \
    cmuDPLLLockMode_Freq,         /* Use frequency lock mode.           */ \
    true,                         /* Enable automatic lock recovery.    */ \
    false                         /* Don't enable dither function.      */ \
  }

/**
 * DPLL initialization values for 76,800,000 Hz using HFXO as reference
 * clock, M = 1919, N = 3839
 */
#define CMU_DPLL_HFXO_TO_76_8MHZ                                           \
  {                                                                        \
    76800000,                     /* Target frequency.                  */ \
    3839,                         /* Factor N.                          */ \
    1919,                         /* Factor M.                          */ \
    cmuSelect_HFXO,               /* Select HFXO as reference clock.    */ \
    cmuDPLLEdgeSel_Fall,          /* Select falling edge of ref clock.  */ \
    cmuDPLLLockMode_Freq,         /* Use frequency lock mode.           */ \
    true,                         /* Enable automatic lock recovery.    */ \
    false                         /* Don't enable dither function.      */ \
  }

/**
 * DPLL initialization values for 80,000,000 Hz using HFXO as reference
 * clock, M = 1919, N = 3999.
 */
#define CMU_DPLL_HFXO_TO_80MHZ                                             \
  {                                                                        \
    80000000,                     /* Target frequency.                  */ \
    (4000 - 1),                   /* Factor N.                          */ \
    (1920 - 1),                   /* Factor M.                          */ \
    cmuSelect_HFXO,               /* Select HFXO as reference clock.    */ \
    cmuDPLLEdgeSel_Fall,          /* Select falling edge of ref clock.  */ \
    cmuDPLLLockMode_Freq,         /* Use frequency lock mode.           */ \
    true,                         /* Enable automatic lock recovery.    */ \
    false                         /* Don't enable dither function.      */ \
  }

/**
 * Default configurations for DPLL initialization. When using this macro
 * you need to modify the N and M factor and the desired frequency to match
 * the components placed on the board.
 */
#define CMU_DPLLINIT_DEFAULT                                               \
  {                                                                        \
    80000000,                     /* Target frequency.                  */ \
    (4000 - 1),                   /* Factor N.                          */ \
    (1920 - 1),                   /* Factor M.                          */ \
    cmuSelect_HFXO,               /* Select HFXO as reference clock.    */ \
    cmuDPLLEdgeSel_Fall,          /* Select falling edge of ref clock.  */ \
    cmuDPLLLockMode_Freq,         /* Use frequency lock mode.           */ \
    true,                         /* Enable automatic lock recovery.    */ \
    false                         /* Don't enable dither function.      */ \
  }

#if defined(USBPLL_PRESENT)
/** USB PLL initialization structure. */
typedef struct {
  CMU_HFXORefFreq_TypeDef hfxoRefFreq;    /**< HFXO reference frequency.   */
  bool          shuntRegEn;               /**< Shunt regulator enable.     */
  bool          disOnDemand;              /**< Disable on-demand requests. */
  bool          forceEn;                  /**< Force oscillator enable.    */
  bool          regLock;                  /**< Enable register lock.       */
} CMU_PLL_Init_TypeDef;

/**
 * Default configurations for USB PLL initialization if the HFXO frequency is
 * 38 MHz.
 */
#define CMU_PLL_REFFREQ_38MHZ                                              \
  {                                                                        \
    cmuHFXORefFreq_38M0Hz,            /* Reference frequency.           */ \
    false,                            /* Disable shunt regulator.       */ \
    false,                            /* Disable PLL always on.         */ \
    false,                            /* Force enable.                  */ \
    true                              /* Enable register lock.          */ \
  }

/**
 * Default configurations for USB PLL initialization if the HFXO frequency is
 * 38.4 MHz.
 */
#define CMU_PLL_REFFREQ_38_4MHZ                                            \
  {                                                                        \
    cmuHFXORefFreq_38M4Hz,            /* Reference frequency.           */ \
    false,                            /* Disable shunt regulator.       */ \
    false,                            /* Disable PLL always on.         */ \
    false,                            /* Force enable.                  */ \
    true                              /* Enable register lock.          */ \
  }

/**
 * Default configurations for USB PLL initialization if the HFXO frequency is
 * 39 MHz.
 */
#define CMU_PLL_REFFREQ_39MHZ                                              \
  {                                                                        \
    cmuHFXORefFreq_39M0Hz,            /* Reference frequency.           */ \
    false,                            /* Disable shunt regulator.       */ \
    false,                            /* Disable PLL always on.         */ \
    false,                            /* Force enable.                  */ \
    true                              /* Enable register lock.          */ \
  }

/**
 * Default configurations for USB PLL initialization if the HFXO frequency is
 * 40 MHz.
 */
#define CMU_PLL_REFFREQ_40MHZ                                              \
  {                                                                        \
    cmuHFXORefFreq_40M0Hz,            /* Reference frequency.           */ \
    false,                            /* Disable shunt regulator.       */ \
    false,                            /* Disable PLL always on.         */ \
    false,                            /* Force enable.                  */ \
    true                              /* Enable register lock.          */ \
  }
#endif

#if defined(RFFPLL_PRESENT)
/**
 * RFF PLL initialization structure. When using this structure you need to
 * modify the X, Y and N factor and the desired frequency to match
 * the components placed on the board (namely the RFFPLL reference clock).
 * X, Y, N values for an 39MHz HFXO.
 * Formula for RFFPLLSYS: freq = HFXOfreq * dividerN / 2 / dividerY
 */
typedef struct {
  uint32_t      frequency;            /**< Target frequency.           */
  bool          disOnDemand;          /**< Disable on-demand requests. */
  bool          forceEn;              /**< Force oscillator enable.    */
  bool          regLock;              /**< Enable register lock.       */
  uint8_t       dividerY;             /**< Divider Y for digital.      */
  uint8_t       dividerX;             /**< Divider X for Radio.        */
  uint8_t       dividerN;             /**< Feedback divider N.         */
} CMU_RFFPLL_Init_TypeDef;

